[
  {
    "id": "1",
    "title": "Hello and Welcome",
    "date": "2024-03-01",
    "type": "professional",
    "subject": "Some background for my website and a quick technical overview",
    "thumbnail": "/assets/posts/1/hello.png",
    "content": "### 👋Thanks for stopping by!\n\n Welcome to my digital space! This site is a small personal project I’ve been working on for fun.  I plan for this to serve as a creative outlet to share what I’ve been working on, what I’ve learned, and the occasional idea or observation that doesn’t fit anywhere else.\n\n The concept for the site was pretty simple in my head, at a high level just a scrollable list of posts with each one expanding into a full page. You can filter between `professional` and `personal`, depending on what you're interested in. \n\n---\n\n ### 🧠 What I’m Using This For\n\nTo be honest, I don’t have much of a plan for this site outside of sharing my projects. This is really just meant to be another fun project for me, so I guess I will post whatever I feel like. \n\nSometimes that might be:\n- 📸 cool photos and personal updates\n- 💻 technical deep dives\n- 🔍 project retrospectives\n- 🧵 longer thoughts outside of tech\n\nI’ll probably aim for one post a month, but I’m sure that won’t be consistent forever.\n\n---\n\n ### 🌀 Why Bother?\n\n Over time, I feel like its common for cool projects, research, and other experiments to fade away, whether they become buried in old folders, forgotten github repos, or old job responsibilities. That’s the main reason why I think a portfolio like this is a great thing- it’s not just a showcase, but a way for myself to organize the work I’ve done and the ideas I’ve explored. Even some projects that felt small at the time can become useful later in life, and this site is a good place for me to collect and reflect on all of it. \n\n---\n\n ### 🧰 Behind the Scenes\n\nThis site is:\n- Built with `React` (functional components)\n- Styled with basic CSS\n- Powered by a bunch of `.json` files for posts\n- Hosted (probably) on GitHub Pages\n\nRight now everything is static and minimal on purpose, since I wanted the content to be the focus. Later on, I might add some interactive elements, games or maybe some AI features.\n\n---\n\nWhether you're here to browse, explore, or just ended up here by accident — thanks for visiting. I hope you find something interesting."
  },
  {
    "id": "2",
    "title": "About Me",
    "date": "2024-03-01",
    "type": "personal",
    "subject": "\nSome more background on myself, my interests, my goals\n",
    "thumbnail": "/assets/posts/2/me.jpg",
    "images": ["img2.jpg"],
    "content": "Hello, I'm Alex — a software engineer, mathematician, student, and researcher based in Virginia. Currently, I am a Junior at Virginia Tech, working toward a double degree in Computer Science and Mathematics. My technical interests largely lie in machine learning and cybersecurity. Specifically, I'm interested in the internals of ML models, LLM security, deep learning, and cybersecurity topics like reverse engineering and application security. On the math side of things, most of my time is spent in two areas: applied cryptography and linear algebra. \n\nOutside of the technical world, I love the outdoors, I do a lot of skiing, climbing, and hiking. I've recently been playing a lot of golf and pickleball, and I've also been trying to stay consistent with my fitness and nutrition. I'm also big into computers and play various videogames. \n\nI was originally born in Delaware, but grew up and lived in Williamsburg, Virginia my whole life. Growing up, I was always interested in computers, so inevitably as a kid I began to mess around on my dad's computer, playing random videogames and accidentally installing a lot of malware. Luckily the computer was okay, because I have been upgrading and using the same one to this day. \n\nAs a kid, along with computers, I had a strong love for math, which led me to all kinds of fun extracurriculars. Despite all that, I had no idea what I wanted to do when I first got to college. Luckily, by the end of freshman year I sort of naturally gravitated back to my interests, and after exploring a few different courses I decided on computer science and soon after added a math major.\n\nSince then, my interests have developed as well as my career goals, and with the recent popularity of LLMs like ChatGPT, I’ve definitely grown more interested in AI/ML, especially the intersection of AI/ML and fields like mathematics and cybersecurity. I’ll be searching for research positions, internships, and jobs in these fields in the near future, and hopefully down the line when I graduate. "
  },
  {
    "id": "3",
    "title": "Graduation",
    "date": "2025-05-25",
    "type": "personal",
    "thumbnail": "/assets/posts/3/grad.png",
    "subject": "Reflection on my time as an undergrad and plans for the future",
    "content": "The fact that I've graduated still has not hit me, maybe because I'm staying another year in Blacksburg or maybe because the years really just flew by. Either way, as I'm wrapping up as an undergraduate it feels like a good time to reflect on what this year looked like, what I’ve learned since I started college, and what’s coming next. \n \n Senior year was pretty different from the rest of my academic years, both in and out of the classroom. In my classes, it felt kind of like everything I've been learning over the past four years finally was coming together, and I developed a much clearer direction. I think a lot of that feeling stems from the nature of higher level classes, where course topics are much more novel and work is much more research-driven, which brings out more connections between math, computer science, and cybersecurity topics. \n \n To zoom out a bit, when I came in as a freshman, I had really no clue what I wanted to do with my life, similar to most 18 year olds. After picking my major, it took another long time of settling in before I really even got involved with any extracurriculars or started honing my interests. It really never felt like I had much established direction for my career until senior year, so a bit of advice to anyone who is unsure what they want to do and thinks it may be too late, there is definitely more time than you think. \n \n As for what's next after graduation, I'll pretty much immediately start my summer internship as a Data Science Engineer at Peraton. After that, I'll be back at Virginia Tech for one more year, to complete my accelerated Master of Engineering. I plan on concentrating my masters degree in AI/ML, and I hope to be able to do some cool research along the way. Beyond that, I will be seeking full time positions starting summer 2026 in software engineering and AI/ML roles. \n \n I’m super grateful for my time spent at Virginia Tech as an undergraduate, it really feels like I’ve grown a ton since I’ve been here in a technical sense as well as a personal sense, so a big thank you to anyone who’s been a part of that, from my friends to my professors to my parents. \n\n ## Freshman  \n[[grid:\nassets/posts/3/fresh1.jpg\nassets/posts/3/fresh3.jpg\nassets/posts/3/fresh2.jpg\n]]  \n\n ## Sophomore  \n[[grid:\nassets/posts/3/soph1.jpg\nassets/posts/3/soph3.jpg\nassets/posts/3/soph2.jpg\n]]\n\n ## Junior \n[[grid:\nassets/posts/3/jun1.jpg\nassets/posts/3/jun2.jpg\nassets/posts/3/jun3.jpg\n]] \n ## Senior \n[[grid:\nassets/posts/3/sen2.jpg\nassets/posts/3/sen1.jpg\nassets/posts/3/sen3.jpg\n]]"
  },
  {
    "id": "4",
    "title": "Junior Year Recap",
    "date": "2024-05-07",
    "thumbnail": "/assets/posts/4/vt.jpg",
    "type": "professional",
    "subject": "Takeaways and challenging projects from my third year at Virginia Tech",
    "content": "### End of Junior Year\n\nThis post marks the end of my junior year - by far the most challenging year I've had hardest academically as well as the most rewarding. Junior year also had some new experiences for me outside of classwork, including a TA position and a couple research opportunities. I've also recently applied for the 4+1 Accelerated Master of Engineering program at Virginia Tech, which would keep me in Blacksburg a fifth year while I get my masters.\n\n### Core CS Courses\n\nAny CS student or alum from Virginia Tech would probably agree with me that three CS courses stand out from the core CS curriculum: Data Structures and Algorithms (CS 3114), Computer Organization II (CS 2506), and Operating Systems (CS 3214). Projects from these courses ate up most of my time this year, but I definitely learned a lot of useful things across the different projects. The most interesting and also notoriously the toughest are the projects for CS3214, operating systems, and while I can't share any source code for these, I can share a quick overview of each:\n\nThe first project was called CUSH, a customizable Unix shell built using POSIX standards that involved things like, job control, signal handling, and process management. It was honestly a great deep dive into how shells work under the hood, which is not something I was very familiar with before, despite using a shell about every time I write any code.\n\nNext was the thread pool project, where we implemented a dynamic thread pool (a collection of threads configured and ready to handle tasks) with a bounded job queue and support for graceful shutdown. This project really showcases all the challenges of parallel programming and synchronization primitives like mutexes and condition variables, and how hard it is to debug many threads at once. Here's a high level overview: \n [[image:assets/posts/4/pool.png]]\n\n The third project was honestly a bit easier than rest, it involved building a custom memory allocator from scratch. I also found this one pretty useful, since memory management is known to be very challenging in low-level languages like C and this project provided a much more comprehensive understanding at the lowest levels possible. \n\nThe last project we had was a personal web server. Specifically, we developed a multithreaded HTTP/1.1 server with support for persistent connections, pipelining, and basic static content serving. This project helped to understand how modern web servers that we use daily manage concurrency and throughput, and it nicely tied together a few subjects from the course.\n\nEven though these projects took endless hours and lots of office hour visits, they all had one important thing in common, and that was giving me a system-level understanding of a tools I'd used at a high level. I find myself frequently thinking back to small things I learned when working on these projects, especially in the terminal. Detailed specification for the projects can all be found [here](https://courses.cs.vt.edu/cs3214/spring2024/projects/duedates) if anyone is curious.\n\n### Positions\n\nOutside of my courses, I also had a few new positions over my junior year: in the fall I worked as an Undergraduate Teaching Assistant for CS, and in the Spring I was a researcher on the Hume Center's Defend the Republic project. \n\nAs a UTA for CS1114, an intro-level class, most of what I was doing was building foundations of object oriented programming for students, through weekly labs and office hours. This job was definitely pretty laid-back, given the course material.\n\nIn the Spring, I was part of a large team on the Defend the Republic project at the Virginia Tech Hume Center with the goal of building a fully automated drone capable of locating, picking up, and delivering a specifically colored balloon. My role on this project was pretty much strictly writing code for the computer vision aspect of our drone. Most of my work was done using the OpenCV libraries in C++ to write traditional computer vision algorithms for tracking both the balloon and the gate to deliver it to. Using machine learning sounds like a natural solution here, but our project's specifications required the drone to be 'lighter-than-air,' meaning we were using a Raspberry Pi Zero as the main computer, which was not quite capable of the ML we would need. Despite the hardware limitations, the project taught me a lot about optimizing for performance in C++, especially in constrained environments. Here's a snapshot of what the 'drones' (they look more like blimps, since they're lighter-than-air) look like: \n [[image:assets/posts/4/drones.jpg]] \n\n### Research\n\nOn top of that, I was a volunteer research assistant all year on a math research project, focused on error correcting codes that can work in quantum systems. This is a smaller project, and my role was likewise smaller, but it served as a great learning experience working through complex proofs and analysis weekly with a couple of math postdoc students. This project also did a great job of reminding me that math can be exploratory, creative, highly collaborative, and above all really enjoyable. Hopefully I will have a paper at some point to talk about the technical portions of this project, but at a high level we spent our time researching CSS codes, their properties, and how they can hold up in quantum systems. \n\n### What's Next\n\nNow that Junior year is done, I'm heading up to live in DC for the summer for an internship at Virginia Tech's Research Center in Arlington, focusing on quantum computing. Hopefully I will have some interesting updates on that to post on here. \n\nIt's definitely been a busy school year, but with that being said it does feel like I'm learning a lot and growing both technically and professionally. This year also really helped me finalize my goals for the rest of my education and long-term for my career.\n\nThat's it for my mostly academic overview of junior year. For now, I'm looking forward to get started in DC!"
  },
  {
    "id": "5",
    "title": "Quantum ML?!",
    "date": "2024-07-03",
    "type": "professional",
    "thumbnail": "/assets/posts/5/quantum.jpg",
    "subject": "A look into my research with the Hume Center for National Security and Technology",
    "content": "My research this summer involved exploration of brand new quantum computing technologies from Quantum Computing Inc., in partnership with the Virginia Tech Hume Center for National Security and Technology. This short paper has some of my notes and research on the potential use of these technologies in machine learning and cryptography. I also included some notes and tests on QCi's uniform quantum random number generator. \n[[pdf:/assets/posts/5/quantum.pdf]]\n "
  },
  {
    "id": "6",
    "title": "Number Fields",
    "date": "2025-03-17",
    "thumbnail": "/assets/posts/6/nums.png",
    "type": "professional",
    "subject": "Fun project on algebraic number theory focused on number fields",
    "content": "This group project focused on an small area of algebraic number theory: number fields. My group and I explored how rational primes behave in specific quadratic number fields. This one might be less interesting for those without an abstract algebra background, but for anyone with that knowledge, there's some surprisingly deep arithmetic and interesting behavior of these specific number fields. \n[[pdf:/assets/posts/6/numberfields.pdf]]\n"
  },
  {
    "id": "7",
    "title": "Pólya Theory",
    "date": "2024-10-28",
    "thumbnail": "/assets/posts/7/math.png",
    "type": "professional",
    "subject": "Fun research project on applications of George Pólya's Enumeration Theorem",
    "content": "This is a fun project exploring some applications of Pólya theory, a powerful combinatorial method for counting distinct configurations under group actions. This was a research project for an abstract algebra course alongside a couple classmates. The project introduces Pólya’s enumeration theorem, Burnside’s lemma, and demonstrates some applications. I think this project did a great job showing how even highly abstract mathematics has applications all over the place, sometimes in places you would never guess. \n[[pdf:/assets/posts/7/polya.pdf]]\n"
  },
  {
    "id": "8",
    "title": "Post-Quantum Crypto",
    "thumbnail": "/assets/posts/8/crypto.jpg",
    "date": "2025-04-25",
    "type": "professional",
    "subject": "Research on post-quantum cryptography, specifically lattice based schemes",
    "content": "This project explores the world of post-quantum cryptography- why we need it, how it works, and how some implementations compare to modern cryptosystems. This paper is focused on lattice-based schemes, which are a leading class of the subset of cyrptosystems resistant to attacks from quantum computers. This project also highlights some key constructions that serve as the building blocks for many post-quantum schemes and actually hold the properties that make the systems unbreakable, even for quantum computers. I hope this project gives a good overview of some lattice-based encryption and signature algorithms and gives an idea of their theoretical strength as well as practality in the real world. \n[[pdf:/assets/posts/8/pqc.pdf]]\n"
  },
  {
    "id": "9",
    "title": "Toxic Data and Evil AI",
    "thumbnail": "/assets/posts/9/evil.png",
    "date": "2025-05-10",
    "type": "professional",
    "subject": "Investigating the susceptibility of different PEFT methods to data poisoning attacks",
    "content": "This was a semester long research project with the goal of investigating the robustness of parameter-efficient fine-tuning (PEFT) methods in the presence of data poisoning attacks. Over the course of the semester, we evaluated several popular PEFT techniques such as LoRA by introducing targeted adversarial data into training pipelines. With high levels of poisoned data, it became clear that even the safest LLMs can become very hostile quickly. Our goal was to identify which methods are more susceptible to model manipulation while preserving high task performance, to simulate a real-world attack. \n[[pdf:/assets/posts/9/datapoisoning.pdf]]\n"
  },
  {
    "id": "10",
    "title": "Summer in the Capital",
    "date": "2024-08-01",
    "type": "personal",
    "thumbnail": "/assets/posts/10/dc.png",
    "subject": "A look back at 10 weeks living in DC as an intern",
    "content": "## Introduction \n\nWith my internship this summer in Arlington coming to a close, my time living in the country’s capital has also come to an end. For more about my internship, the post labeled Quantum ML will give a good technical overview of some of what I was doing. This post will be the other side of things, just talking about my experience living in DC for 10 weeks.\n\n ## First Impressions \n\nPretty much as soon as I moved into my apartment I started work, so unfortunately I wasn’t left much time to explore around. My place was in Foggy Bottom, the neighborhood where George Washington University is located. The neighborhood itself was quite nice, there was not a bustling downtown scene but I still enjoyed the feel of it and it was close enough to everything I needed. My work was at the Virginia Tech Research Center in Arlington, Virginia, so luckily for me my commute was going the opposite direction of most. As for my work, I really enjoyed the location. It was right downtown in the Ballston neighborhood of Arlington, which felt like a really great area to be, a little bit of everything and a lot of people. \n\n It didn’t take me too long to break into a routine once I started full-time work. I like to save myself enough time to workout and then cook myself dinner at a reasonable hour, so I worked 8-4, 3 days a week in the office, 2 days at home. The DC metro was surprisingly very smooth all summer, I never had any problems and it was nice and clean. Most weekdays for me started leaving my apartment around 7:15 and I usually made it back from work before 5, which honestly left me with a lot of free time, especially with a commute on the DC metro. \n\n ## Summer Activities \n\n After a little bit of settling in, my friends in the area and I all of course wanted to check out all the new fun and exciting places nearby. I of course also had to go back to check out my favorite childhood museums, the Air and Space Museum and the Spy Museum, both still as cool as ever. Over the summer, I attended some fun concerts, had some interesting but delicious food, and ran all around the national mall a few times a week. Most of my excursions on weekends included rock climbing at the Sportrock Climbing Center in Alexandria, a new hobby I picked up this summer. With that being said, it was overall a pretty quiet summer- I upgraded and rebuilt my computer and played through the entirety of Elden Ring for the first time. Not like that’s a bad thing though, I certainly enjoyed it. \n\n It was a brutally hot summer, so outside of going for runs it was hard for me to find motivation to spend too much time outside. I definitely felt bad for all of the interns that worked on Capital Hill I saw on the metro everyday in full suits and ties in the heat. Despite the heat, it was definitely a great experience being in the city and being around thousands of other interns. It was a huge contrast from Blacksburg, where there are only about 20,000 year round residents. I met a lot of really cool people from all over the world this summer, some with like-minded interests and careers and some on completely different paths. \n\n ## Reflection \n\n Spending the summer in DC gave me a new appreciation for the area beyond just its monuments and politics. It seems like there is always something fun or interesting happening, no matter what type of person you are. I think that what stood out the most was the energy, maybe this kind of cliche but it did seem a place full of people who are driven and constantly moving forward, which made it feel more exciting just to be here. \n\n Professionally, there’s so much happening in tech and AI right now, and as someone interested in AI being surrounded by people working at the cutting edge of those fields was really motivating. Just as importantly, DC and the broader NoVA area just feel like a great place for young people to land. It’s somewhere I could certainly see myself returning to after I graduate not only for the career prospects, but for the lifestyle and various offerings of the city. \n ## \n[[grid:\nassets/posts/10/food1.jpg\nassets/posts/10/climb.jpg\nassets/posts/10/food2.jpg\n]]"
  },
  {
    "id": "11",
    "title": "Granada, Spain",
    "date": "2024-03-30",
    "type": "personal", 
    "thumbnail": "/assets/posts/11/spain.jpg",
    "subject": "Collection of photos and memories from an amazing trip to Spain",
    "content": "Over Spring break, I flew out with a group to Granada, Spain to visit our friend studying abroad. It was a phenomenal trip overall, we ate lots of good food, saw beautiful and historical landmarks, and even did some hiking. We spent almost the whole week in Granada, and despite speaking little to no Spanish, I think my favorite part about the trip was the feeling of experiencing a new culture in a new place. Hopefully the photos here will give a good snapshot of the trip from my eyes. \n ## Alhambra \n[[grid:\nassets/posts/11/alhambra1.jpg\nassets/posts/11/alhambra3.jpg\nassets/posts/11/alhambra2.jpg\nassets/posts/11/alhambra4.jpg\nassets/posts/11/alhambra5.jpg\nassets/posts/11/alhambra6.jpg\n]]\n\n## Wandering the Albaicín\n[[grid:\nassets/posts/11/wandering1.jpg\nassets/posts/11/wandering4.jpg\nassets/posts/11/wandering3.jpg\nassets/posts/11/wandering2.jpg\nassets/posts/11/wandering6.jpg\nassets/posts/11/wandering5.jpg\n]]\n\n ## Cahorros de Monachil\n[[grid:\nassets/posts/11/hike2.jpg\nassets/posts/11/hike4.jpg\nassets/posts/11/hike5.jpg\nassets/posts/11/hike1.jpg\nassets/posts/11/hike3.jpg\nassets/posts/11/hike6.jpg\n]]\n\n## Málaga and Alcazaba\n[[grid:\nassets/posts/11/malaga3.jpg\nassets/posts/11/malaga1.jpg\nassets/posts/11/malaga2.jpg\nassets/posts/11/malaga4.jpg\nassets/posts/11/malaga7.jpg\nassets/posts/11/malaga8.jpg\nassets/posts/11/malaga5.jpg\nassets/posts/11/malaga10.jpg\nassets/posts/11/malaga6.jpg\n]]\n\n## Food, Friends, and Fun\n[[grid:\nassets/posts/11/food1.jpg\nassets/posts/11/food2.jpg\nassets/posts/11/food12.jpg\nassets/posts/11/food9.jpg\nassets/posts/11/food10.jpg\nassets/posts/11/food14.jpg\nassets/posts/11/food8.jpg\nassets/posts/11/food4.jpg\nassets/posts/11/food6.jpg\n\nassets/posts/11/food7.jpg\nassets/posts/11/food11.jpg\nassets/posts/11/food13.jpg\n]]"
  },
  {
    "id": "12",
    "title": "Winter Fun",
    "date": "2025-01-20",
    "type": "personal",
    "thumbnail": "/assets/posts/12/ski.jpg",
    "subject": "Gallery of some a couple fun ski trips this winter",
    "content": "## Copper Mountain\n[[grid:\nassets/posts/12/copper1.jpg\nassets/posts/12/copper2.jpg\nassets/posts/12/copper4.jpg\nassets/posts/12/copper7.jpg\nassets/posts/12/copper5.jpg\nassets/posts/12/copper6.jpg\nassets/posts/12/copper9.jpg\nassets/posts/12/copper8.jpg\nassets/posts/12/copper3.jpg\n]]\n\n ## Arapahoe Basin \n[[grid:\nassets/posts/12/basin1.jpg\nassets/posts/12/basin2.jpg\nassets/posts/12/basin3.jpg\nassets/posts/12/basin8.jpg\nassets/posts/12/basin4.jpg\nassets/posts/12/basin9.jpg\n]]\n\n"
  },
  {
    "id": "13",
    "title": "Cracking iPhones",
    "date": "2024-09-29",
    "type": "professional",
    "thumbnail": "/assets/posts/13/phone.png",
    "subject": "Research on iOS reverse engineering and vulnerability detection",
    "content": "## Starting Senior Year\n\nIt always feels a bit strange to call myself a senior, because it doesn’t really feel like I’m graduating anytime soon. I’m technically in the final year of my undergraduate degree, but I’m now officially staying for one more year in Blacksburg to finish my accelerated master’s, which I've actually already started. It's definitely a lot harder to get sentimental about 'second-to-lasts' as opposed to the 'last football game!!!' and 'Last FDOC!!!' posts that I'm used to seeing with most of my friends graduating.\n\nWith that being said, this year does feel different from the rest, maybe because of a drop in my workload, maybe because I'm 21 now, or maybe something else (hopefully). Around the start of my senior year, I was accepted to the HIRF (Hume IC CAE Research Fellowship) program, which is a yearlong research fellowship on a project relating to national security. My project is titled 'Mobile Reverse Engineering and Vulnerability Detection,' and I'm working with another student (Cam Mraz) and two representatives from partner company L3Harris along with our supervisor from the Hume Center, Dr. Mark Thompson.\n\n## Background\n\nReverse engineering has always been a subject of interest to me, so I was super excited when I heard about what my project would be. So much software today is closed source and black box, and that opacity always motivates me to attempt to dig a little deeper and find out what's really going on. At the lowest level possible, everything running on your computer is just 1s and 0s, so with some background knowledge of assembly code and reverse engineering tools you can get a decent understanding of an application's structure, just from a binary file.\n\nFor our research, we will be focusing on reverse engineering iOS apps, which is definitely much more of a challenge than an application running on a Windows or a Linux desktop. This is of course due to Apple's extremely strict security measures when it comes to iOS, especially apps on the app store. This means that there were a few hiccups we had to solve before we could even start the reverse engineering process, including obtaining the binary file.\n\nThis project is focused on a group of iOS messaging apps that share a specific property, and our main goal is to find potential vulnerabilities caused by that property. I won't share any specific results or findings here, but I'll do my best to outline the reverse engineering process for these types of iOS apps and what we are using.\n\n## Tools\n\nTo set up for this project, we first needed a source for our binary files, which ended up being fresh iPhone 16s. These iPhones have iOS 18 automatically, which does have very strict security measures compared to iOS 16 and before. Next, we needed an environment to do our reverse engineering, which led to the most important tool we are using on this project: **Ghidra**, a free and open source tool developed by the NSA for reverse engineering. Ghidra is best described as a software reverse engineering framework, and has a vast amount of tools for reverse engineering. We mostly use Ghidra for static analysis, including the built in functions for disassembly and decompiling.\n\nBeyond these two, we have been testing out a few less popular tools for things like obtaining binaries, certificates, and signing apps.\n\n [[image:assets/posts/13/ghidra.png]]\n\n## Process\n\nOnce we had the binary files, we could begin reverse engineering, which for us usually starts in Ghidra. A large chunk of the work on this project is **static analysis** of the binary files in Ghidra. The static analysis portion is crucial to the project, since we can grasp an understanding of the structure and design of the app as well as locate potential entry points for patches without ever seeing the source code.\n\nWe usually search for markers such as conditional branches and examine references to hardcoded error strings (e.g., “hash mismatch” or “checksum failed”) in order to locate relevant functions that handle message validation or app integrity checks. Ghidra provides tools that make this process much easier, and enables us to save our progress by re-labeling functions and variables.\n\nWe also take advantage of the function call graphs and disassembled specific instructions to understand how the user inputs propagate through the binary. This also helps us identify where modifications can be safely injected to suppress errors or potentially bypass verification logic. Throughout the process, Ghidra’s decompiler and label features make it easier to annotate the binary file and attempt to isolate security related functions, so we can test areas for potential patching.\n\n [[image:assets/posts/13/reversing.png]]\n\n ## Patching\n\nOne method we are attempting to use to find vulnerabilities is patching, which is simply described as minor modifications to an app that can uncover major problems. We are using the IPAPatch [^ipapatch] framework in our project, which is a repository designed to work with XCode to inject Objective-C methods at runtime into a binary file. This also works on an un-jailbroken phone, which is key for our project, since jailbreaking is not possible on iOS18 devices.\n\nIn practice, this involves first locating a function we wanted to patch and finding its address within Ghidra as well as a safe offset to redirect or replace. In some cases, this means changing conditional branches by modifying just one line of assembly instructions, for example replacing a B.EQ with an unconditional, while in others, we erased the function entirely by replacing its contents with a simple return.\n\nThese patches can be implemented in Objective-C using IPAPatch’s +load method, which executes on app startup. This allowed us to hook into specific classes or methods and inject our alternate logic. For example, one patch we tested involved overriding a method responsible for hash checking to always return a success value, likely on app startup.\n\nOur project only began a couple months ago and runs the entire academic year, so this process is definitely still in development. I probably won’t be allowed to share specific results if we find something cool, but I hope to be able to show some more details of the patching in the future.\n\n[^ipapatch]: https://github.com/NyaMisty/IPAPatch"
  }
]